Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
            <instance name="OCMP7">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
            <instance name="OCMP8">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
            <instance name="OCMP9">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
            <instance name="OCMP10">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 8"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 9"/>
                 </parameters>
            </instance>
            <instance name="OCMP11">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 8"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 9"/>
                 </parameters>
            </instance>
            <instance name="OCMP12">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 8"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 9"/>
                 </parameters>
            </instance>
            <instance name="OCMP13">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
            <instance name="OCMP14">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
            <instance name="OCMP15">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
            <instance name="OCMP16">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                 </parameters>
            </instance>
         </module>
         <module id="00815" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph_pb1_std" name="PCACHE" name-in-module="PCACHE" offset="0x1f800800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00751" name="PMP" version="">
            <instance name="PMP">
               <register-group address-space="periph_pb2_std" name="PMP" name-in-module="PMP" offset="0x1f82e000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01494" name="QEI" version="">
            <instance name="QEI1">
               <register-group address-space="periph_pb2_std" name="QEI" name-in-module="QEI" offset="0x1f82b200" />
               <parameters>
                  <param name="" value=""/>
               </parameters>
            </instance>
            <instance name="QEI2">
               <parameters>
                  <param name="" value=""/>
               </parameters>
            </instance>
            <instance name="QEI3">
               <parameters>
                  <param name="" value=""/>
               </parameters>
            </instance>
            <instance name="QEI4">
               <parameters>
                  <param name="" value=""/>
               </parameters>
            </instance>
            <instance name="QEI5">
               <parameters>
                  <param name="" value=""/>
               </parameters>
            </instance>
            <instance name="QEI6">
               <parameters>
                  <param name="" value=""/>
               </parameters>
            </instance>
         </module>
