Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="Digital Comparator 'x' Analog Input Identification bits" name="ADCCMPCON3__AINID">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1c" />
         <value caption="AN27" name="" value="0x1b" />
         <value caption="AN26" name="" value="0x1a" />
         <value caption="AN25" name="" value="0x19" />
         <value caption="AN24" name="" value="0x18" />
         <value caption="AN23" name="" value="0x17" />
         <value caption="AN22" name="" value="0x16" />
         <value caption="AN21" name="" value="0x15" />
         <value caption="AN20" name="" value="0x14" />
         <value caption="AN19" name="" value="0x13" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/Low Digital Comparator x Event bit" name="ADCCMPCON4__IELOLO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPLO&lt;15:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/High Digital Comparator x Event bit" name="ADCCMPCON4__IELOHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPLO bits &lt; DATA&lt;31:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low Digital Comparator x Event bit" name="ADCCMPCON4__IEHILO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/High Digital Comparator x Event bit" name="ADCCMPCON4__IEHIHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPHI bits &lt;= DATA&lt;31:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' &quot;Output True&quot; Event Status bit" name="ADCCMPCON4__DCMPED">
         <value caption="Digital Comparator x output true event has occurred (output of Comparator is 1)" name="" value="0x1" />
         <value caption="Digital Comparator x output is false (output of Comparator is 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Global Interrupt Enable bit" name="ADCCMPCON4__DCMPGIEN">
         <value caption="A Digital Comparator x interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1" />
         <value caption="A Digital Comparator x interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Enable bit" name="ADCCMPCON4__ENDCMP">
         <value caption="Digital Comparator x is enabled" name="" value="0x1" />
         <value caption="Digital Comparator x is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 'x' Analog Input Identification bits" name="ADCCMPCON4__AINID">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1c" />
         <value caption="AN27" name="" value="0x1b" />
         <value caption="AN26" name="" value="0x1a" />
         <value caption="AN25" name="" value="0x19" />
         <value caption="AN24" name="" value="0x18" />
         <value caption="AN23" name="" value="0x17" />
         <value caption="AN22" name="" value="0x16" />
         <value caption="AN21" name="" value="0x15" />
         <value caption="AN20" name="" value="0x14" />
         <value caption="AN19" name="" value="0x13" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC0" name="ADCDSTAT__RAF0">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC1" name="ADCDSTAT__RAF1">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC2" name="ADCDSTAT__RAF2">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC3" name="ADCDSTAT__RAF3">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC4" name="ADCDSTAT__RAF4">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Ping-Pong Buffer A Full Status bits for ADC5" name="ADCDSTAT__RAF5">
         <value caption="RAM DMA ping-pong Buffer A is full" name="" value="0x1" />
         <value caption="RAM DMA ping-pong Buffer A is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC0" name="ADCDSTAT__RAFIEN0">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC1" name="ADCDSTAT__RAFIEN1">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC2" name="ADCDSTAT__RAFIEN2">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC3" name="ADCDSTAT__RAFIEN3">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC4" name="ADCDSTAT__RAFIEN4">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer A Full Interrupt Enable bits for ADC5" name="ADCDSTAT__RAFIEN5">
         <value caption="Enable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer A interrupt requests for ADC" name="" value="0x0" />
      </value-group>
