Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="Shared ADC Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN7">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled the ADC module needs a warm-up time as defined by the WKUPCLKCNT bits." name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY0">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY1">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY2">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY3">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY4">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC5-ADC0 Wake-up Status bit" name="ADCANCON__WKRDY5">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Wake-up Status bit" name="ADCANCON__WKRDY7">
         <value caption="ADC7 Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANEN7 to 1" name="" value="0x1" />
         <value caption="ADC7 Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN0">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN1">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN2">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN3">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN4">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN5">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN7">
         <value caption="Enable interrupt and generate interrupt when the WKRDY7 status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake-up Clock Count bits" name="ADCANCON__WKUPCLKCNT">
         <value caption="215 = 32768 clocks" name="" value="0xf" />
         <value caption="26 = 64 clocks" name="" value="0x6" />
         <value caption="25 = 32 clocks" name="" value="0x5" />
         <value caption="24 = 16 clocks" name="" value="0x4" />
         <value caption="24 = 16 clocks" name="" value="0x3" />
         <value caption="24 = 16 clocks" name="" value="0x2" />
         <value caption="24 = 16 clocks" name="" value="0x1" />
         <value caption="24 = 16 clocks" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01152" name="CAN" version="1">
      <register-group name="CAN">
         <register caption="CAN Module Control Register" name="C1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="C1CON__DNCNT" />
            <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="CANBUSY" values="C1CON__CANBUSY" />
            <bitfield caption="CAN Stop in Idle bit" mask="0x00002000" name="SIDL" values="C1CON__SIDL" />
            <bitfield caption="CAN On bit" mask="0x00008000" name="ON" values="C1CON__ON" />
            <bitfield caption="CAN Message Receive Time Stamp Timer Capture Enable bit" mask="0x00100000" name="CANCAP" values="C1CON__CANCAP" />
            <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="C1CON__OPMOD" />
            <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="C1CON__REQOP" />
            <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="C1CON__ABAT" />
         </register>
         <register caption="CAN Module Control Register" name="C2CON" offset="0x1000" rw="RW" size="4">
            <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="C2CON__DNCNT" />
            <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="CANBUSY" values="C2CON__CANBUSY" />
            <bitfield caption="CAN Stop in Idle bit" mask="0x00002000" name="SIDL" values="C2CON__SIDL" />
            <bitfield caption="CAN On bit" mask="0x00008000" name="ON" values="C2CON__ON" />
            <bitfield caption="CAN Message Receive Time Stamp Timer Capture Enable bit" mask="0x00100000" name="CANCAP" values="C2CON__CANCAP" />
            <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="C2CON__OPMOD" />
            <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="C2CON__REQOP" />
            <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="C2CON__ABAT" />
         </register>
