Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
         <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT0" offset="0x360" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT0__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT0__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT0__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT0__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT0__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT0__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT0__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT0__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT0__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT0__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT0__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT0__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT0__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT0__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C2FIFOINT0" offset="0x1360" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C2FIFOINT0__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C2FIFOINT0__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C2FIFOINT0__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C2FIFOINT0__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C2FIFOINT0__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C2FIFOINT0__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C2FIFOINT0__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C2FIFOINT0__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C2FIFOINT0__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C2FIFOINT0__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C2FIFOINT0__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C2FIFOINT0__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C2FIFOINT0__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C2FIFOINT0__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C3FIFOINT0" offset="0x4360" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C3FIFOINT0__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C3FIFOINT0__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C3FIFOINT0__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C3FIFOINT0__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C3FIFOINT0__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C3FIFOINT0__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C3FIFOINT0__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C3FIFOINT0__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C3FIFOINT0__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C3FIFOINT0__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C3FIFOINT0__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C3FIFOINT0__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C3FIFOINT0__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C3FIFOINT0__TXNFULLIE" />
         </register>
