Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="Synchronization Jump Width bits" name="C2CFG__SJW">
         <value caption="Length is 4 x Tq" name="" value="0x3" />
         <value caption="Length is 3 x Tq" name="" value="0x2" />
         <value caption="Length is 2 x Tq" name="" value="0x1" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Propagation Time Segment bits" name="C2CFG__PRSEG">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Buffer Segment 1 bits" name="C2CFG__SEG1PH">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Sample of the CAN Bus Line bit" name="C2CFG__SAM">
         <value caption="Bus line is sampled three times at the sample point" name="" value="0x1" />
         <value caption="Bus line is sampled once at the sample point" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Segment 2 Time Select bit" name="C2CFG__SEG2PHTS">
         <value caption="Freely programmable" name="" value="0x1" />
         <value caption="Maximum of SEG1PH or Information Processing Time" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Buffer Segment 2 bits" name="C2CFG__SEG2PH">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Line Filter Enable bit" name="C2CFG__WAKFIL">
         <value caption="Use CAN bus line filter for wake-up" name="" value="0x1" />
         <value caption="CAN bus line filter is not used for wake-up" name="" value="0x0" />
      </value-group>
      <value-group caption="Baud Rate Prescaler bits" name="C3CFG__BRP">
         <value caption="Tq = (2 x 64)/Tpbclk5" name="" value="0x3f" />
         <value caption="Tq = (2 x 63)/Tpbclk5" name="" value="0x3e" />
         <value caption="Tq = (2 x 2)/Tpbclk5" name="" value="0x1" />
         <value caption="Tq = (2 x 1)/Tpbclk5" name="" value="0x0" />
      </value-group>
      <value-group caption="Synchronization Jump Width bits" name="C3CFG__SJW">
         <value caption="Length is 4 x Tq" name="" value="0x3" />
         <value caption="Length is 3 x Tq" name="" value="0x2" />
         <value caption="Length is 2 x Tq" name="" value="0x1" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Propagation Time Segment bits" name="C3CFG__PRSEG">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Buffer Segment 1 bits" name="C3CFG__SEG1PH">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Sample of the CAN Bus Line bit" name="C3CFG__SAM">
         <value caption="Bus line is sampled three times at the sample point" name="" value="0x1" />
         <value caption="Bus line is sampled once at the sample point" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Segment 2 Time Select bit" name="C3CFG__SEG2PHTS">
         <value caption="Freely programmable" name="" value="0x1" />
         <value caption="Maximum of SEG1PH or Information Processing Time" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Buffer Segment 2 bits" name="C3CFG__SEG2PH">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Line Filter Enable bit" name="C3CFG__WAKFIL">
         <value caption="Use CAN bus line filter for wake-up" name="" value="0x1" />
         <value caption="CAN bus line filter is not used for wake-up" name="" value="0x0" />
      </value-group>
      <value-group caption="Baud Rate Prescaler bits" name="C4CFG__BRP">
         <value caption="Tq = (2 x 64)/Tpbclk5" name="" value="0x3f" />
         <value caption="Tq = (2 x 63)/Tpbclk5" name="" value="0x3e" />
         <value caption="Tq = (2 x 2)/Tpbclk5" name="" value="0x1" />
         <value caption="Tq = (2 x 1)/Tpbclk5" name="" value="0x0" />
      </value-group>
      <value-group caption="Synchronization Jump Width bits" name="C4CFG__SJW">
         <value caption="Length is 4 x Tq" name="" value="0x3" />
         <value caption="Length is 3 x Tq" name="" value="0x2" />
         <value caption="Length is 2 x Tq" name="" value="0x1" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Propagation Time Segment bits" name="C4CFG__PRSEG">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Buffer Segment 1 bits" name="C4CFG__SEG1PH">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Sample of the CAN Bus Line bit" name="C4CFG__SAM">
         <value caption="Bus line is sampled three times at the sample point" name="" value="0x1" />
         <value caption="Bus line is sampled once at the sample point" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Segment 2 Time Select bit" name="C4CFG__SEG2PHTS">
         <value caption="Freely programmable" name="" value="0x1" />
         <value caption="Maximum of SEG1PH or Information Processing Time" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Buffer Segment 2 bits" name="C4CFG__SEG2PH">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
