Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="Filter 5 Mask Select bits" name="C2FLTCON1__MSEL5">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 17 Enable bit" name="C2FLTCON1__FLTEN5">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON1__FSEL6">
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 6 Mask Select bits" name="C2FLTCON1__MSEL6">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 6 Enable bit" name="C2FLTCON1__FLTEN6">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON1__FSEL7">
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 7 Mask Select bits" name="C2FLTCON1__MSEL7">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 7 Enable bit" name="C2FLTCON1__FLTEN7">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C3FLTCON1__FSEL4">
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 4 Mask Select bits" name="C3FLTCON1__MSEL4">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 4 Enable bit" name="C3FLTCON1__FLTEN4">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C3FLTCON1__FSEL5">
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 5 Mask Select bits" name="C3FLTCON1__MSEL5">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 17 Enable bit" name="C3FLTCON1__FLTEN5">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C3FLTCON1__FSEL6">
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
