Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="Flash Control Permission Group bits" name="CFGPG__FCPG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Permission bits" name="CFGPG__ADCPG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="CFGCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1" />
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0" />
      </value-group>
      <value-group caption="Trace Output Enable bit" name="CFGCON__TROEN">
         <value caption="Enable trace outputs and start trace clock (trace probe must be present)" name="" value="0x1" />
         <value caption="Disable trace outputs and stop trace clock" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="CFGCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1" />
         <value caption="Disable the JTAG port" name="" value="0x0" />
      </value-group>
      <value-group caption="I/O Analog Charge Pump Enable bit" name="CFGCON__IOANCPEN">
         <value caption="Charge pump is enabled" name="" value="0x1" />
         <value caption="Charge pump is disabled (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Permission Group Lock bit" name="CFGCON__PGLOCK">
         <value caption="Permission Group registers are locked. Writes to PG registers are not allowed" name="" value="0x1" />
         <value caption="Permission Group registers are not locked. Writes to PG registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Module Disable bit" name="CFGCON__PMDLOCK">
         <value caption="Peripheral module is locked. Writes to PMD registers are not allowed" name="" value="0x1" />
         <value caption="Peripheral module is not locked. Writes to PMD registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Pin Select Lock bit" name="CFGCON__IOLOCK">
         <value caption="Peripheral Pin Select is locked. Writes to PPS registers are not allowed" name="" value="0x1" />
         <value caption="Peripheral Pin Select is not locked. Writes to PPS registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Alternate Clock Selection bit" name="CFGCON__OCACLK">
         <value caption="Output Compare modules use an alternative Timer pair as their timebase clock" name="" value="0x1" />
         <value caption="All Output Compare modules use Timer2/3 as their timebase clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Alternate Clock Selection bit" name="CFGCON__ICACLK">
         <value caption="Input Capture modules use an alternative Timer pair as their timebase clock" name="" value="0x1" />
         <value caption="All Input Capture modules use Timer2/3 as their timebase clock" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN1">
         <value caption="PWMxL functionality is replaced by PWMxH functionality" name="" value="0x1" />
         <value caption="PWMxL functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN2">
         <value caption="PWMxL functionality is replaced by PWMxH functionality" name="" value="0x1" />
         <value caption="PWMxL functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN3">
         <value caption="PWMxL functionality is replaced by PWMxH functionality" name="" value="0x1" />
         <value caption="PWMxL functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN4">
         <value caption="PWMxL functionality is replaced by PWMxH functionality" name="" value="0x1" />
         <value caption="PWMxL functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN5">
         <value caption="PWMxL functionality is replaced by PWMxH functionality" name="" value="0x1" />
         <value caption="PWMxL functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Alternate I/O Pin Selection bit" name="CFGCON__PWMAPIN6">
         <value caption="PWMxL functionality is replaced by PWMxH functionality" name="" value="0x1" />
         <value caption="PWMxL functionality remains on pins" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Arbitration Priority to SRAM bit" name="CFGCON__ADCPRI">
         <value caption="ADC gets High Priority access to SRAM" name="" value="0x1" />
         <value caption="ADC uses Least Recently Serviced Arbitration (same as other initiators)" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Op amp 1 to PGA Mode bit" name="CFGCON2__ENPGA1">
         <value caption="Op amp enable 1x gain mode" name="" value="0x1" />
         <value caption="Op amp 3-terminal standard operation (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Op amp 2 to PGA Mode bit" name="CFGCON2__ENPGA2">
         <value caption="Op amp enable 1x gain mode" name="" value="0x1" />
         <value caption="Op amp 3-terminal standard operation (default)" name="" value="0x0" />
      </value-group>
