Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="Reference Oscillator Trim bits" name="REFO2TRIM__ROTRIM">
         <value caption="511/512 divisor added to RODIV value" name="" value="0x1ff" />
         <value caption="510/512 divisor added to RODIV value" name="" value="0x1fe" />
         <value caption="256/512 divisor added to RODIV value" name="" value="0x100" />
         <value caption="2/512 divisor added to RODIV value" name="" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="" value="0x1" />
         <value caption="0 divisor added to RODIV value" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Trim bits" name="REFO3TRIM__ROTRIM">
         <value caption="511/512 divisor added to RODIV value" name="" value="0x1ff" />
         <value caption="510/512 divisor added to RODIV value" name="" value="0x1fe" />
         <value caption="256/512 divisor added to RODIV value" name="" value="0x100" />
         <value caption="2/512 divisor added to RODIV value" name="" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="" value="0x1" />
         <value caption="0 divisor added to RODIV value" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Trim bits" name="REFO4TRIM__ROTRIM">
         <value caption="511/512 divisor added to RODIV value" name="" value="0x1ff" />
         <value caption="510/512 divisor added to RODIV value" name="" value="0x1fe" />
         <value caption="256/512 divisor added to RODIV value" name="" value="0x100" />
         <value caption="2/512 divisor added to RODIV value" name="" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="" value="0x1" />
         <value caption="0 divisor added to RODIV value" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB1DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x &lt; 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB1DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB1DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB2DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x &lt; 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB2DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB2DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB3DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x &lt; 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB3DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB3DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB4DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x &lt; 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB4DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB4DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB5DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x &lt; 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB5DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB5DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB6DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x &lt; 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB6DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
