Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB6DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB7DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x &lt; 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB7DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB7DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Switching Slewing Active Status bit" name="SLEWCON__BUSY">
         <value caption="Clock frequency is being actively slewed to the new frequency" name="" value="0x1" />
         <value caption="Clock switch has reached its final value" name="" value="0x0" />
      </value-group>
      <value-group caption="Downward Slew Enable bit" name="SLEWCON__DNEN">
         <value caption="Slewing enabled for switching to a lower frequency" name="" value="0x1" />
         <value caption="Slewing disabled for switching to a lower frequency" name="" value="0x0" />
      </value-group>
      <value-group caption="Upward Slew Enable bit" name="SLEWCON__UPEN">
         <value caption="Slewing enabled for switching to a higher frequency" name="" value="0x1" />
         <value caption="Slewing disabled for switching to a higher frequency" name="" value="0x0" />
      </value-group>
      <value-group caption="Slew Divisor Steps Control bits" name="SLEWCON__SLWDIV">
         <value caption="Steps are divide by 128" name="" value="0x7" />
         <value caption="Steps are divide by 64" name="" value="0x6" />
         <value caption="Steps are divide by 32" name="" value="0x5" />
         <value caption="Steps are divide by 16" name="" value="0x4" />
         <value caption="Steps are divide by 8" name="" value="0x3" />
         <value caption="Steps are divide by 4" name="" value="0x2" />
         <value caption="Steps are divide by 2" name="" value="0x1" />
         <value caption="No divisor is used during slewing" name="" value="0x0" />
      </value-group>
      <value-group caption="System Clock Divide Control bits" name="SLEWCON__SYSDIV">
         <value caption="SYSCLK is divided by 16" name="" value="0xf" />
         <value caption="SYSCLK is divided by 15" name="" value="0xe" />
         <value caption="SYSCLK is divided by 3" name="" value="0x2" />
         <value caption="SYSCLK is divided by 2" name="" value="0x1" />
         <value caption="SYSCLK is not divided" name="" value="0x0" />
      </value-group>
      <value-group caption="Fast RC Oscillator Ready Status bit" name="CLKSTAT__FRCRDY">
         <value caption="FRC is stable and ready" name="" value="0x1" />
         <value caption="FRC is disabled for not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary Oscillator Ready Status bit" name="CLKSTAT__POSCRDY">
         <value caption="Posc is stable and ready" name="" value="0x1" />
         <value caption="Posc is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator Ready Status bit" name="CLKSTAT__SOSCRDY">
         <value caption="Sosc is stable and ready" name="" value="0x1" />
         <value caption="Sosc is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Power RC Oscillator Ready Status bit" name="CLKSTAT__LPRCRDY">
         <value caption="LPRC is stable and ready" name="" value="0x1" />
         <value caption="LPRC is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="System PLL Ready Status bit" name="CLKSTAT__SPLLRDY">
         <value caption="SPLL is ready" name="" value="0x1" />
         <value caption="SPLL is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="USB PLL Ready Status bit" name="CLKSTAT__UPLLRDY">
         <value caption="UPLL is ready" name="" value="0x1" />
         <value caption="UPLL is not ready" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02823" name="RCON" version="2">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON" offset="0x40" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Deadman Timer Time-out Flag bit" mask="0x00000020" name="DMTO" values="RCON__DMTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset (MCLR) Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
            <bitfield caption="Deep Sleep Mode Flag bit" mask="0x00000400" name="DPSLP" values="RCON__DPSLP" />
            <bitfield caption="VBAT Mode Flag bit" mask="0x00010000" name="VBAT" values="RCON__VBAT" />
            <bitfield caption="VBPOR Mode Flag bit" mask="0x00020000" name="VBPOR" values="RCON__VBPOR" />
            <bitfield caption="Core Voltage POR Flag bit" mask="0x40000000" name="PORCORE" values="RCON__PORCORE" />
            <bitfield caption="I/O Voltage POR Flag bit" mask="0x80000000" name="PORIO" values="RCON__PORIO" />
         </register>
         <register caption="Software Reset Register" name="RSWRST" offset="0x50" rw="W" size="4">
            <bitfield caption="Software Reset Trigger bit" mask="0x00000001" name="SWRST" values="RSWRST__SWRST" />
         </register>
