Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
         <register caption="Non-Maskable Interrupt (NMI) Control Register" name="RNMICON" offset="0x60" rw="RW" size="4">
            <bitfield caption="NMI Reset Counter Value bits" mask="0x0000FFFF" name="NMICNT" values="RNMICON__NMICNT" />
            <bitfield caption="Watchdog Timer Time-out in Sleep Mode Flag bit (Setting this bit will cause a WDT NMI)" mask="0x00010000" name="WDTS" values="RNMICON__WDTS" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00020000" name="CF" values="RNMICON__CF" />
            <bitfield mask="0x00040000" name="HLVD" />
            <bitfield caption="General NMI bit" mask="0x00080000" name="GNMI" values="RNMICON__GNMI" />
            <bitfield caption="Software NMI Trigger." mask="0x00800000" name="SWNMI" values="RNMICON__SWNMI" />
            <bitfield caption="Watchdog Timer Time-Out Flag bit" mask="0x01000000" name="WDTO" values="RNMICON__WDTO" />
            <bitfield caption="Deadman Timer Time-out Flag bit" mask="0x02000000" name="DMTO" values="RNMICON__DMTO" />
         </register>
         <register caption="Power Control Register" name="PWRCON" offset="0x70" rw="RW" size="4">
            <bitfield caption="Internal Voltage Regulator Stand-by Enable bit" mask="0x00000001" name="VREGS" values="PWRCON__VREGS" />
            <bitfield mask="0x00000030" name="VREGSLP" />
            <bitfield mask="0x000000C0" name="VREGRUN" />
         </register>
      </register-group>
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RCON__DMTO">
         <value caption="A DMT time-out has occurred" name="" value="0x1" />
         <value caption="A DMT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset was not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset (MCLR) Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="" value="0x1" />
         <value caption="A Configuration Mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Mode Flag bit" name="RCON__DPSLP">
         <value caption="Deep Sleep mode has occurred" name="" value="0x1" />
         <value caption="Deep Sleep mode has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="VBAT Mode Flag bit" name="RCON__VBAT">
         <value caption="A POR exit from VBAT has occurred (a true POR must be established with the valid VBAT voltage on the VBAT pin)" name="" value="0x1" />
         <value caption="A POR exit from VBAT has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="VBPOR Mode Flag bit" name="RCON__VBPOR">
         <value caption="A VBAT domain POR has occurred" name="" value="0x1" />
         <value caption="A VBAT domain POR has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Core Voltage POR Flag bit" name="RCON__PORCORE">
         <value caption="A Power-up Reset has occurred due to Core Voltage" name="" value="0x1" />
         <value caption="A Power-up Reset has not occurred due to Core Voltage" name="" value="0x0" />
      </value-group>
      <value-group caption="I/O Voltage POR Flag bit" name="RCON__PORIO">
         <value caption="A Power-up Reset has occurred due to I/O Voltage" name="" value="0x1" />
         <value caption="A Power-up Reset has not occurred due to I/O Voltage" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="NMI Reset Counter Value bits" name="RNMICON__NMICNT">
         <value caption="255 SYSCLK cycles before a device Reset occurs" name="" value="0xff" />
         <value caption="254 SYSCLK cycles before a device Reset occurs" name="" value="0xfe" />
         <value caption="1 SYSCLK cycle before a device Reset occurs" name="" value="0x1" />
         <value caption="No delay between NMI assertion and device Reset event" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out in Sleep Mode Flag bit (Setting this bit will cause a WDT NMI)" name="RNMICON__WDTS">
         <value caption="WDT time-out has occurred during Sleep mode and caused a wake-up from sleep" name="" value="0x1" />
         <value caption="WDT time-out has not occurred during Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="" value="0x1" />
         <value caption="FSCM has not detected clock failure" name="" value="0x0" />
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="" value="0x1" />
         <value caption="A general NMI event has not been detected" name="" value="0x0" />
      </value-group>
