Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
         <register caption="EEPROM KEY REGISTER" name="EEKEY" offset="0x10" rw="W" size="4">
            <bitfield caption="Data EEPROM Key bits" mask="0x0000FFFF" name="EEKEY" values="EEKEY__EEKEY" />
         </register>
         <register caption="EEPROM ADDRESS REGISTER" name="EEADDR" offset="0x20" rw="RW" size="4">
            <bitfield caption="Data EEPROM Address bits" mask="0x0000FFFF" name="EEADR" values="EEADDR__EEADR" />
         </register>
         <register caption="EEPROM DATA REGISTER" name="EEDATA" offset="0x30" rw="RW" size="4">
            <bitfield caption="Data EEPROM Data bits" mask="0xFFFFFFFF" name="EEDATA" values="EEDATA__EEDATA" />
         </register>
      </register-group>
      <value-group caption="Data EEPROM Command Selection bits" name="EECON__CMD">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Configuration register Write command (WREN bit must be set)" name="" value="0x4" />
         <value caption="Data EEPROM memory Bulk Erase command (WREN bit must be set)" name="" value="0x3" />
         <value caption="Data EEPROM memory Page Erase command (WREN bit must be set)" name="" value="0x2" />
         <value caption="Word Write command (WREN bit must be set)" name="" value="0x1" />
         <value caption="Word Read command (WREN bit must be clear)" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Imminent Long Write Status bit" name="EECON__ILW">
         <value caption="The next write to the EEPROM address (held in the EEADDR register) will require more time (approx 20 ms) than usual" name="" value="0x1" />
         <value caption="The next write to the EEPROM address (held in the EEADDR register) will be a normal write cycle" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Sequence Error Status bits" name="EECON__ERR">
         <value caption="A BOR event has occurred" name="" value="0x3" />
         <value caption="An attempted execution of a read or write operation with an invalid write OR command with a misaligned address (EEADDR(1:0) not 00)" name="" value="0x2" />
         <value caption="A Bulk or Page Erase or a Word Program verify error has occurred" name="" value="0x1" />
         <value caption="No error condition" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Write Enable Control bit" name="EECON__WREN">
         <value caption="Enables program or erase operations" name="" value="0x1" />
         <value caption="Disables program or erase of memory elements, and enables read operations" name="" value="0x0" />
      </value-group>
      <value-group caption="Start Command Execution Control bit" name="EECON__RW">
         <value caption="(when WREN is 1)Start memory word program or erase command / (when WREN is 0)Cleared by hardware to indicate read operation has completed" name="" value="0x1" />
         <value caption="(when WREN is 1)Cleared by hardware to indicate program or erase operation has completed / (when WREN is 0)Cleared by hardware to indicate read operation has completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Abort Operation Control bit" name="EECON__ABORT">
         <value caption="Set by software to abort the on-going write command as soon as possible" name="" value="0x1" />
         <value caption="Data EEPROM panel is ready/Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="EECON__SIDL">
         <value caption="Discontinue operation when CPU enters in Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Ready bit" name="EECON__RDY">
         <value caption="Data EEPROM is ready for access" name="" value="0x1" />
         <value caption="Data EEPROM is not ready for access" name="" value="0x0" />
      </value-group>
      <value-group caption="Data EEPROM Power Control bit" name="EECON__ON">
         <value caption="Data EEPROM is enabled" name="" value="0x1" />
         <value caption="Data EEPROM is disabled" name="" value="0x0" />
      </value-group>
    </module>
   <module caption="" id="02467" name="GPIO" version="1">
      <register-group name="GPIO">
         <register caption="" name="ANSELA" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSA0" />
            <bitfield mask="0x00000002" name="ANSA1" />
            <bitfield mask="0x00000010" name="ANSA4" />
            <bitfield mask="0x00000100" name="ANSA8" />
            <bitfield mask="0x00000800" name="ANSA11" />
            <bitfield mask="0x00001000" name="ANSA12" />
         </register>
         <register caption="" name="ANSELB" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSB0" />
            <bitfield mask="0x00000002" name="ANSB1" />
            <bitfield mask="0x00000004" name="ANSB2" />
            <bitfield mask="0x00000008" name="ANSB3" />
            <bitfield mask="0x00000080" name="ANSB7" />
            <bitfield mask="0x00000200" name="ANSB9" />
         </register>
         <register caption="" name="ANSELC" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSC0" />
            <bitfield mask="0x00000002" name="ANSC1" />
            <bitfield mask="0x00000004" name="ANSC2" />
            <bitfield mask="0x00000400" name="ANSC10" />
            <bitfield mask="0x00000800" name="ANSC11" />
            <bitfield mask="0x00001000" name="ANSC12" />
         </register>
         <register caption="" name="ANSELE" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00001000" name="ANSE12" />
            <bitfield mask="0x00002000" name="ANSE13" />
            <bitfield mask="0x00004000" name="ANSE14" />
            <bitfield mask="0x00008000" name="ANSE15" />
         </register>
         <register caption="" name="ANSELG" offset="0x600" rw="RW" size="4">
            <bitfield mask="0x00000040" name="ANSG6" />
            <bitfield mask="0x00000080" name="ANSG7" />
            <bitfield mask="0x00000100" name="ANSG8" />
            <bitfield mask="0x00000200" name="ANSG9" />
         </register>
