Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
         <register caption="" name="TRISA" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISA0" />
            <bitfield mask="0x00000002" name="TRISA1" />
            <bitfield mask="0x00000010" name="TRISA4" />
            <bitfield mask="0x00000080" name="TRISA7" />
            <bitfield mask="0x00000100" name="TRISA8" />
            <bitfield mask="0x00000400" name="TRISA10" />
            <bitfield mask="0x00000800" name="TRISA11" />
            <bitfield mask="0x00001000" name="TRISA12" />
         </register>
         <register caption="" name="TRISB" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISB0" />
            <bitfield mask="0x00000002" name="TRISB1" />
            <bitfield mask="0x00000004" name="TRISB2" />
            <bitfield mask="0x00000008" name="TRISB3" />
            <bitfield mask="0x00000010" name="TRISB4" />
            <bitfield mask="0x00000020" name="TRISB5" />
            <bitfield mask="0x00000040" name="TRISB6" />
            <bitfield mask="0x00000080" name="TRISB7" />
            <bitfield mask="0x00000100" name="TRISB8" />
            <bitfield mask="0x00000200" name="TRISB9" />
            <bitfield mask="0x00000400" name="TRISB10" />
            <bitfield mask="0x00000800" name="TRISB11" />
            <bitfield mask="0x00001000" name="TRISB12" />
            <bitfield mask="0x00002000" name="TRISB13" />
            <bitfield mask="0x00004000" name="TRISB14" />
            <bitfield mask="0x00008000" name="TRISB15" />
         </register>
         <register caption="" name="TRISC" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISC0" />
            <bitfield mask="0x00000002" name="TRISC1" />
            <bitfield mask="0x00000004" name="TRISC2" />
            <bitfield mask="0x00000040" name="TRISC6" />
            <bitfield mask="0x00000080" name="TRISC7" />
            <bitfield mask="0x00000100" name="TRISC8" />
            <bitfield mask="0x00000200" name="TRISC9" />
            <bitfield mask="0x00000400" name="TRISC10" />
            <bitfield mask="0x00000800" name="TRISC11" />
            <bitfield mask="0x00001000" name="TRISC12" />
            <bitfield mask="0x00002000" name="TRISC13" />
            <bitfield mask="0x00004000" name="TRISC14" />
            <bitfield mask="0x00008000" name="TRISC15" />
         </register>
         <register caption="" name="TRISD" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000020" name="TRISD5" />
            <bitfield mask="0x00000040" name="TRISD6" />
            <bitfield mask="0x00000100" name="TRISD8" />
         </register>
         <register caption="" name="TRISE" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISE0" />
            <bitfield mask="0x00001000" name="TRISE12" />
            <bitfield mask="0x00002000" name="TRISE13" />
            <bitfield mask="0x00004000" name="TRISE14" />
            <bitfield mask="0x00008000" name="TRISE15" />
         </register>
         <register caption="" name="TRISF" offset="0x510" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISF0" />
            <bitfield mask="0x00000002" name="TRISF1" />
         </register>
         <register caption="" name="TRISG" offset="0x610" rw="RW" size="4">
            <bitfield mask="0x00000040" name="TRISG6" />
            <bitfield mask="0x00000080" name="TRISG7" />
            <bitfield mask="0x00000100" name="TRISG8" />
            <bitfield mask="0x00000200" name="TRISG9" />
         </register>
         <register caption="" name="PORTA" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RA0" />
            <bitfield mask="0x00000002" name="RA1" />
            <bitfield mask="0x00000010" name="RA4" />
            <bitfield mask="0x00000080" name="RA7" />
            <bitfield mask="0x00000100" name="RA8" />
            <bitfield mask="0x00000400" name="RA10" />
            <bitfield mask="0x00000800" name="RA11" />
            <bitfield mask="0x00001000" name="RA12" />
         </register>
         <register caption="" name="PORTB" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RB0" />
            <bitfield mask="0x00000002" name="RB1" />
            <bitfield mask="0x00000004" name="RB2" />
            <bitfield mask="0x00000008" name="RB3" />
            <bitfield mask="0x00000010" name="RB4" />
            <bitfield mask="0x00000020" name="RB5" />
            <bitfield mask="0x00000040" name="RB6" />
            <bitfield mask="0x00000080" name="RB7" />
            <bitfield mask="0x00000100" name="RB8" />
            <bitfield mask="0x00000200" name="RB9" />
            <bitfield mask="0x00000400" name="RB10" />
            <bitfield mask="0x00000800" name="RB11" />
            <bitfield mask="0x00001000" name="RB12" />
            <bitfield mask="0x00002000" name="RB13" />
            <bitfield mask="0x00004000" name="RB14" />
            <bitfield mask="0x00008000" name="RB15" />
         </register>
         <register caption="" name="PORTC" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RC0" />
            <bitfield mask="0x00000002" name="RC1" />
            <bitfield mask="0x00000004" name="RC2" />
            <bitfield mask="0x00000040" name="RC6" />
            <bitfield mask="0x00000080" name="RC7" />
            <bitfield mask="0x00000100" name="RC8" />
            <bitfield mask="0x00000200" name="RC9" />
            <bitfield mask="0x00000400" name="RC10" />
            <bitfield mask="0x00000800" name="RC11" />
            <bitfield mask="0x00001000" name="RC12" />
            <bitfield mask="0x00002000" name="RC13" />
            <bitfield mask="0x00004000" name="RC14" />
            <bitfield mask="0x00008000" name="RC15" />
         </register>
         <register caption="" name="PORTD" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x00000020" name="RD5" />
            <bitfield mask="0x00000040" name="RD6" />
            <bitfield mask="0x00000100" name="RD8" />
         </register>
         <register caption="" name="PORTE" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x00001000" name="RE12" />
            <bitfield mask="0x00002000" name="RE13" />
            <bitfield mask="0x00004000" name="RE14" />
            <bitfield mask="0x00008000" name="RE15" />
         </register>
