Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON3" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON3__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON3__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON3__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON3__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON3__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON3__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON3__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON3__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON3__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON3__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON3__PWMLIEN" />
            <bitfield mask="0x00200000" name="TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON3__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON3__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON3__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON3__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON3__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON3__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON3__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON4" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON4__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON4__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON4__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON4__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON4__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON4__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON4__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON4__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON4__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON4__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON4__PWMLIEN" />
            <bitfield mask="0x00200000" name="TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON4__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON4__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON4__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON4__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON4__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON4__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON4__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON5" offset="0x4c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON5__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON5__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON5__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON5__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON5__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON5__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON5__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON5__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON5__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON5__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON5__PWMLIEN" />
            <bitfield mask="0x00200000" name="TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON5__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON5__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON5__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON5__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON5__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON5__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON5__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON6" offset="0x5c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON6__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON6__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON6__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON6__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON6__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON6__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON6__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON6__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON6__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON6__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON6__PWMLIEN" />
            <bitfield mask="0x00200000" name="TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON6__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON6__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON6__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON6__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON6__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON6__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON6__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON7" offset="0x6c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON7__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON7__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON7__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON7__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON7__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON7__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON7__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON7__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON7__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON7__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON7__PWMLIEN" />
            <bitfield mask="0x00200000" name="TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON7__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON7__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON7__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON7__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON7__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON7__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON7__FLTIF" />
         </register>
