Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON1" offset="0xd0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON1__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON1__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON1__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON1__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON1__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON1__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON1__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON1__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON1__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON1__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON1__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON1__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON1__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON1__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON1__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON1__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON2" offset="0x1d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON2__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON2__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON2__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON2__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON2__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON2__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON2__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON2__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON2__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON2__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON2__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON2__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON2__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON2__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON2__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON2__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON3" offset="0x2d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON3__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON3__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON3__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON3__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON3__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON3__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON3__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON3__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON3__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON3__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON3__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON3__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON3__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON3__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON3__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON3__CLSRC" />
         </register>
