Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC1" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC2" offset="0x1e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC3" offset="0x2e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC4" offset="0x3e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC5" offset="0x4e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC6" offset="0x5e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC7" offset="0x6e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC8" offset="0x7e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC9" offset="0x8e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC10" offset="0x9e0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC11" offset="0xae0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Generator Duty Cycle Register x (x = 1 through 12)" name="PDC12" offset="0xbe0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC1" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC2" offset="0x1f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC3" offset="0x2f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC4" offset="0x3f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC5" offset="0x4f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC6" offset="0x5f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC7" offset="0x6f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC8" offset="0x7f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC9" offset="0x8f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC10" offset="0x9f0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC11" offset="0xaf0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Secondary Duty Cycle Register x (x = 1 through 12)" name="SDC12" offset="0xbf0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE1" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE2" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE3" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE4" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE5" offset="0x500" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE6" offset="0x600" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE7" offset="0x700" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE8" offset="0x800" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE9" offset="0x900" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
