Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE10" offset="0xa00" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE11" offset="0xb00" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Primary Phase Shift Register x (x = 1 through 12)" name="PHASE12" offset="0xc00" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR1" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR2" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR3" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR4" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR5" offset="0x510" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR6" offset="0x610" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR7" offset="0x710" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR8" offset="0x810" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR9" offset="0x910" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR10" offset="0xa10" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR11" offset="0xb10" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Dead Time Register x (x = 1 through 12)" name="DTR12" offset="0xc10" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR1" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR2" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR3" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR4" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR5" offset="0x520" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR6" offset="0x620" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR7" offset="0x720" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR8" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR9" offset="0x920" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR10" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR11" offset="0xb20" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="PWM Alternate Dead Time Register x (x = 1 through 12)" name="ALTDTR12" offset="0xc20" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP1" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP2" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP3" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP4" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="Dead Time Compensation Register x (x = 1 through 12)" name="DTCOMP5" offset="0x530" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="COMP" />
         </register>
