Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG4" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG5" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG6" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG7" offset="0x760" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG8" offset="0x860" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG9" offset="0x960" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG10" offset="0xa60" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG11" offset="0xb60" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG12" offset="0xc60" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP1" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP2" offset="0x270" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP3" offset="0x370" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP4" offset="0x470" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP5" offset="0x570" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP6" offset="0x670" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP7" offset="0x770" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP8" offset="0x870" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP9" offset="0x970" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP10" offset="0xa70" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP11" offset="0xb70" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP12" offset="0xc70" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON1" offset="0x180" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON1__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON1__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON1__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON1__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON1__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON1__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON2" offset="0x280" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON2__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON2__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON2__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON2__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON2__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON2__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON3" offset="0x380" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON3__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON3__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON3__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON3__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON3__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON3__PHR" />
         </register>
