Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="PWM High Phase Interrupt Enable bit" name="PWMCON2__PWMHIEN">
         <value caption="When the PWM Period matches the value in the PWM timer" name="" value="0x1" />
         <value caption="PWM Period event interrupt request is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Low Phase Interrupt Enable bit" name="PWMCON2__PWMLIEN">
         <value caption="When the PWM Timer is equal to 0x4" name="" value="0x1" />
         <value caption="PWM Period event interrupt request is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Interrupt Enable bit" name="PWMCON2__CLIEN">
         <value caption="Current-limit interrupt is enabled. If CLIF is 1" name="" value="0x1" />
         <value caption="Current-limit interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Enable bit" name="PWMCON2__FLTIEN">
         <value caption="Fault interrupt is enabled. If FLTIF is 1" name="" value="0x1" />
         <value caption="Fault interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMH Interrupt Status bit" name="PWMCON2__PWMHIF">
         <value caption="PWM period match interrupt has occurred" name="" value="0x1" />
         <value caption="PWM period match interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="PWML Interrupt Status bit" name="PWMCON2__PWMLIF">
         <value caption="PWM Timer equal to 0x0 interrupt has occurred" name="" value="0x1" />
         <value caption="PWM Interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Interrupt Status bit" name="PWMCON2__TRGIF">
         <value caption="Trigger interrupt is pending" name="" value="0x1" />
         <value caption="Trigger interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Status bit" name="PWMCON2__CLIF">
         <value caption="Current limit has occurred" name="" value="0x1" />
         <value caption="Current limit has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Flag bit" name="PWMCON2__FLTIF">
         <value caption="Fault interrupt has occurred" name="" value="0x1" />
         <value caption="Fault interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="External PWM Reset Control bit" name="PWMCON3__XPRES">
         <value caption="Current-limit source resets primary local time base for this PWM generator if it is in Independent Time Base mode and the PWM module enters the deassertion portion of the duty cycle" name="" value="0x1" />
         <value caption="External pins do not affect PWM time base" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Time Base Select bit" name="PWMCON3__MTBS">
         <value caption="Secondary master time base is the clock source for the MCPWM module" name="" value="0x1" />
         <value caption="Primary master time base is the clock source for the MCPWM module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Timer Direction bit" name="PWMCON3__PTDIR">
         <value caption="PWM timer is decrementing" name="" value="0x1" />
         <value caption="PWM timer is incrementing" name="" value="0x0" />
      </value-group>
      <value-group caption="Dead Time Compensation Polarity bit" name="PWMCON3__DTCP">
         <value caption="(If DTCMPx pin is 0)PWMxL is shortened" name="" value="0x1" />
         <value caption="(If DTCMPx pin is 0)PWMxH is shortened" name="" value="0x0" />
      </value-group>
      <value-group caption="Dead Time Control bits" name="PWMCON3__DTC">
         <value caption="Dead Time Compensation mode enabled" name="" value="0x3" />
         <value caption="Dead time function is disabled" name="" value="0x2" />
         <value caption="Negative dead time actively applied for Complementary Output mode" name="" value="0x1" />
         <value caption="Positive dead time actively applied for all output modes" name="" value="0x0" />
      </value-group>
      <value-group caption="Independent Time Base Mode bit" name="PWMCON3__ITB">
         <value caption="PHASEx registers provide time base period for this PWM generator" name="" value="0x1" />
         <value caption="PTPER/STPER register provides timing for this PWM generator based on the MTBS bit" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge/Center-Aligned Mode Enable bits" name="PWMCON3__ECAM">
         <value caption="Asymmetric Center-Aligned mode with simultaneous update (PWM(min) Duty Cycle Resolution = (1/FSYSCLK))" name="" value="0x3" />
         <value caption="Asymmetric Center-Aligned mode double update (PWM(min) Duty Cycle Resolution = (1/FSYSCLK))" name="" value="0x2" />
         <value caption="Symmetric Center-Aligned mode (PWM(min) Duty Cycle Resolution = (2/FSYSCLK))" name="" value="0x1" />
         <value caption="Edge-Aligned mode (PWM(min) Duty Cycle Resolution = (1/FSYSCLK))" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" name="PWMCON3__CLTSTAT">
         <value caption="Current-limit interrupt is pending" name="" value="0x1" />
         <value caption="No current-limit interrupt is pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" name="PWMCON3__FLTSTAT">
         <value caption="Fault interrupt is pending" name="" value="0x1" />
         <value caption="No fault interrupt is pending" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM High Phase Interrupt Enable bit" name="PWMCON3__PWMHIEN">
         <value caption="When the PWM Period matches the value in the PWM timer" name="" value="0x1" />
         <value caption="PWM Period event interrupt request is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Low Phase Interrupt Enable bit" name="PWMCON3__PWMLIEN">
         <value caption="When the PWM Timer is equal to 0x4" name="" value="0x1" />
         <value caption="PWM Period event interrupt request is disabled" name="" value="0x0" />
      </value-group>
