Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="PWMxL Falling Edge Trigger Enable bit" name="LEBCON6__PLF">
         <value caption="Falling edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Rising Edge Trigger Enable bit" name="LEBCON6__PLR">
         <value caption="Rising edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Falling Edge Trigger Enable bit" name="LEBCON6__PHF">
         <value caption="Falling edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Rising Edge Trigger Enable bit" name="LEBCON6__PHR">
         <value caption="Rising edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Leading-Edge Blanking Enable bit" name="LEBCON7__CLLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected current-limit input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected current-limit input" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Input Leading-Edge Blanking Enable bit" name="LEBCON7__FLTLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected fault input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected fault input" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Falling Edge Trigger Enable bit" name="LEBCON7__PLF">
         <value caption="Falling edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Rising Edge Trigger Enable bit" name="LEBCON7__PLR">
         <value caption="Rising edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Falling Edge Trigger Enable bit" name="LEBCON7__PHF">
         <value caption="Falling edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Rising Edge Trigger Enable bit" name="LEBCON7__PHR">
         <value caption="Rising edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Leading-Edge Blanking Enable bit" name="LEBCON8__CLLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected current-limit input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected current-limit input" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Input Leading-Edge Blanking Enable bit" name="LEBCON8__FLTLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected fault input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected fault input" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Falling Edge Trigger Enable bit" name="LEBCON8__PLF">
         <value caption="Falling edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Rising Edge Trigger Enable bit" name="LEBCON8__PLR">
         <value caption="Rising edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Falling Edge Trigger Enable bit" name="LEBCON8__PHF">
         <value caption="Falling edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Rising Edge Trigger Enable bit" name="LEBCON8__PHR">
         <value caption="Rising edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Leading-Edge Blanking Enable bit" name="LEBCON9__CLLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected current-limit input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected current-limit input" name="" value="0x0" />
      </value-group>
