Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
         <register caption="" name="OC9RS" offset="0x1020" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC9RS" />
         </register>
         <register caption="" name="OC10RS" offset="0x21220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC10RS" />
         </register>
         <register caption="" name="OC11RS" offset="0x21420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC11RS" />
         </register>
         <register caption="" name="OC12RS" offset="0x21620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC12RS" />
         </register>
         <register caption="" name="OC13RS" offset="0x21820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC13RS" />
         </register>
         <register caption="" name="OC14RS" offset="0x21a20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC14RS" />
         </register>
         <register caption="" name="OC15RS" offset="0x21c20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC15RS" />
         </register>
         <register caption="" name="OC16RS" offset="0x21e20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC16RS" />
         </register>
      </register-group>
      <value-group caption="Output Compare Mode Select bits" name="OC1CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC1CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC1CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC1CON__OC32">
         <value caption="OCxR and/or OCxRS&lt;31:0&gt; are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR and OCxRS&lt;15:0&gt; are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC1CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC1CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC2CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC2CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC2CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC2CON__OC32">
         <value caption="OCxR and/or OCxRS&lt;31:0&gt; are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR and OCxRS&lt;15:0&gt; are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC2CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC2CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC3CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC3CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
