Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="Stop in Idle Mode bit" name="QEI4CON__QEISIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Quadrature Encoder Interface Module Counter Enable bit" name="QEI4CON__QEIEN">
         <value caption="Module counters are enabled" name="" value="0x1" />
         <value caption="Module counters are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Counter Control Mode Selection bits" name="QEI5CON__CCM">
        <value caption="Internal Timer Mode. QEB High is Timer Run, QEB Low is Timer Stop" name="" value="0x3" />
        <value caption="QEA is the external clock input. QEB High is Clock Run, QEB Low is Clock Stop" name="" value="0x2" />
        <value caption="QEA is the external clock input. QEB High is Count Up, QEB Low is Count Down" name="" value="0x1" />
        <value caption="Quadrature Encoder Interface Count mode (x4 mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="External Count Gate Enable bit" name="QEI5CON__GATEN">
         <value caption="External gate signal controls position counter operation" name="" value="0x1" />
         <value caption="External gate signal does not affect position counter/timer operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Position and Index Counter/Timer Direction Select bit" name="QEI5CON__CNTPOL">
         <value caption="Counter direction is negative unless modified by external Up/Down signal" name="" value="0x1" />
         <value caption="Counter direction is positive unless modified by external Up/Down signal" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits " name="QEI5CON__INTDIV">
         <value caption="1:128 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Index Match Value bits" name="QEI5CON__IMV">
         <value caption="Index match occurs when QEB is 1 and QEA is 1" name="" value="0x3" />
         <value caption="Index match occurs when QEB is 1 and QEA is 0" name="" value="0x2" />
         <value caption="Index match occurs when QEB is 0 and QEA is 1" name="" value="0x1" />
         <value caption="Index match occurs when QEB is 0 and QEA is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Mode Select bits" name="QEI5CON__PIMOD">
         <value caption="Modulo Count mode for position counter and every index event resets the position counter" name="" value="0x7" />
         <value caption="Modulo Count mode for position counter" name="" value="0x6" />
         <value caption="Resets the position counter when the position counter equals QEIxICCH register" name="" value="0x5" />
         <value caption="Second index event after home event initializes position counter with contents of QEIxICCHregister" name="" value="0x4" />
         <value caption="First index event after home event initializes position counter with contents of QEIxICCH register" name="" value="0x3" />
         <value caption="Next index input event initializes the position counter with contents of QEIxICCH register" name="" value="0x2" />
         <value caption="Every Index input event resets the position counter" name="" value="0x1" />
         <value caption="Index input event does not affect position counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="QEI5CON__QEISIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Quadrature Encoder Interface Module Counter Enable bit" name="QEI5CON__QEIEN">
         <value caption="Module counters are enabled" name="" value="0x1" />
         <value caption="Module counters are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Counter Control Mode Selection bits" name="QEI6CON__CCM">
        <value caption="Internal Timer Mode. QEB High is Timer Run, QEB Low is Timer Stop" name="" value="0x3" />
        <value caption="QEA is the external clock input. QEB High is Clock Run, QEB Low is Clock Stop" name="" value="0x2" />
        <value caption="QEA is the external clock input. QEB High is Count Up, QEB Low is Count Down" name="" value="0x1" />
        <value caption="Quadrature Encoder Interface Count mode (x4 mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="External Count Gate Enable bit" name="QEI6CON__GATEN">
         <value caption="External gate signal controls position counter operation" name="" value="0x1" />
         <value caption="External gate signal does not affect position counter/timer operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Position and Index Counter/Timer Direction Select bit" name="QEI6CON__CNTPOL">
         <value caption="Counter direction is negative unless modified by external Up/Down signal" name="" value="0x1" />
         <value caption="Counter direction is positive unless modified by external Up/Down signal" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits " name="QEI6CON__INTDIV">
         <value caption="1:128 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
