Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/atdf/PIC32MK0512MCF064.atdf
      <value-group caption="Position Counter Less Than or Equal Compare Status bit" name="QEI5STAT__PCLEQIRQ">
         <value caption="POSxCNT" name="" value="0x1" />
         <value caption="POSxCNT &gt; QEIxCMPL" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" name="QEI5STAT__PCHEQIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Status bit" name="QEI5STAT__PCHEQIRQ">
         <value caption="POSxCNT" name="" value="0x1" />
         <value caption="POSxCNT &lt; QEIxICCH" name="" value="0x0" />
      </value-group>
      <value-group caption="Index Input Event Interrupt Enable bit" name="QEI6STAT__IDXIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Status Flag for Index Event Status bit" name="QEI6STAT__IDXIRQ">
         <value caption="Index event has occurred" name="" value="0x1" />
         <value caption="No Index event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Home Input Event Interrupt Enable bit" name="QEI6STAT__HOMIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Status Flag for Home Event Status bit" name="QEI6STAT__HOMIRQ">
         <value caption="Home event has occurred" name="" value="0x1" />
         <value caption="No Home event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Velocity Counter Overflow Interrupt Enable bit" name="QEI6STAT__VELOVIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Velocity Counter Overflow Status bit" name="QEI6STAT__VELOVIRQ">
         <value caption="Overflow has occurred" name="" value="0x1" />
         <value caption="No overflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Interrupt Enable bit" name="QEI6STAT__PCIIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Status bit " name="QEI6STAT__PCIIRQ">
         <value caption="POSxCNT was reinitialized" name="" value="0x1" />
         <value caption="POSxCNT was not reinitialized" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Overflow Interrupt Enable bit" name="QEI6STAT__POSOVIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Overflow Status bit" name="QEI6STAT__POSOVIRQ">
         <value caption="Overflow has occurred" name="" value="0x1" />
         <value caption="No overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" name="QEI6STAT__PCLEQIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Status bit" name="QEI6STAT__PCLEQIRQ">
         <value caption="POSxCNT" name="" value="0x1" />
         <value caption="POSxCNT &gt; QEIxCMPL" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" name="QEI6STAT__PCHEQIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Status bit" name="QEI6STAT__PCHEQIRQ">
         <value caption="POSxCNT" name="" value="0x1" />
         <value caption="POSxCNT &lt; QEIxICCH" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01423" name="RPIN" version="">
      <register-group name="RPIN">
         <register caption="" name="INT1R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT1R" />
         </register>
         <register caption="" name="INT2R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT2R" />
         </register>
         <register caption="" name="INT3R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT3R" />
         </register>
         <register caption="" name="INT4R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT4R" />
         </register>
         <register caption="" name="T2CKR" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T2CKR" />
         </register>
         <register caption="" name="T3CKR" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T3CKR" />
         </register>
         <register caption="" name="T4CKR" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T4CKR" />
         </register>
         <register caption="" name="T5CKR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T5CKR" />
         </register>
         <register caption="" name="T6CKR" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T6CKR" />
         </register>
